/****************************************************/
/* Лабораторна робота № 7 */
/* Обчислення значень періодичної функції. */
/* Приклад виконання. Варіант № 30 */
/****************************************************/
#include <stdio.h>
#include <math.h>
int main(void) {
	short n; /* параметр зовнішнього циклу */
	double x, у; /* абсциса і ордината графіка */
	short h; /* позиція точки на екрані */
	/* зовнішній цикл - для 5 періодів */
	for (n = 0; n < 5; n++) {
		/* виведення заголовка таблиці */
		printf("| x | у |\n");
		printf("|-------|------------|\n");
		/* внутрішній цикл для одного періоду */
		for (x = 0; x < 4; x += 0.25) {
			/* 1-й відрізок */
			if (x < 1) у = 2 * x - 1;
			/* 2-й відрізок */
			else if (x < 3) у = 1 - sqrt(1 - (x - 2) * (x - 2));
			/* 3-й відрізок */
			else у = 7 - 2 * x;
			/* виведення рядка таблиці */
			printf("| %5.2lf | %10.7lf |", x + n * 4, у);
			/* визначення позиції точки */
			h = (у + 1) * 10;
			if (у - 1 - h * 10 > 0.5) h++;
			/* виведення точки графіка */
			for (; h > 0; h--) printf(" ");
			printf("*\n");
		} /* кінець внутрішнього циклу */
		/* пауза до введення команди оператора */
		printf("Натисніть клавішу Enter...");
		getchar();
	} /* кінець зовнішнього циклу */
	return 0;
} /* кінець програми */
